export default {
    //modbus
  modbus_msg_1: 'オブジェクト名を入力してください！',
  modbus_msg_2: 'ポイントの作成に成功しました！',
  modbus_msg_3: 'ポイントの変更に成功しました！',
  modbus_msg_4: 'データの削除に成功しました！',
  modbus_msg_5: 'データの更新に成功しました！',
  modbus_msg_6: 'リンクを選択してください！',

    //gauge
  gauge_msg_1: 'コンフィグデータの更新に成功しました！',
  gauge_msg_2: 'データの更新に失敗しました！',
  gauge_msg_3: 'このコンフィグはオブジェクトに紐付いていません！',
  gauge_msg_4: 'データの更新に失敗しました。書き込み権限がありません！',

    //login
  login_msg_1: 'ログインに成功しました！',
  login_msg_2: 'ユーザー名またはパスワードが正しくありません！',
  login_msg_3: 'ハードウェアチェックに失敗しました。管理者に連絡してください！',

  please_input_chart: '少なくとも1文字入力してください！',

  creat_job_error: '作成に失敗しました！',

  msg_error_1: 'エラー属性：書き込みアクセスが拒否されました。',
  msg_error_2: '実行に失敗しました。',
  msg_error_3: 'このデバイスの有効スイッチをオンにしてください！',
  msg_error_4: 'ポイントがオフライン状態のため、操作を実行できません！',
  msg_error_5: 'アドレス形式が正しくありません！',
  msg_error_6: 'データ検証に失敗しました！',

  msg_error_7: '解放する優先度を選択してください！',
  msg_error_8: 'プロジェクトが空のため、プレビューできません！',
  msg_error_9: 'デバイスが見つかりませんでした！',

  msg_error_10: 'システムは最大12文字までしか入力できません',
  msg_error_11: 'コンポーネントのインポートに失敗しました。ファイルの完全性を確認してください！',
  msg_error_12: 'アップロードできるのは【JSON】形式のファイルのみです。再アップロードしてください！',
  msg_error_13: 'インポートに失敗しました。データを確認するか管理者に連絡してください！',

  msg_success_1: 'インポートに成功しました！',

}